app/views/items/show.html.erb

          <!-- Comments Form -->
          <% @comentarios_aux = Comentario.where(:item_id =>@item.id )%>
          <% @comentarios_aux.each do |coment| %>
            <%@usuario = User.find_by(id:coment.user_id)%>
---
SELECT "comentarios".* FROM "comentarios" WHERE "comentarios"."item_id" = ?  [["item_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]