app/controllers/comentarios_controller.rb

SELECT "comentarios".* FROM "comentarios"
---
  def index
    @comentarios = Comentario.all

INSERT INTO "comentarios" ("user_id", "item_id", "comentario_txt", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["item_id", 1], ["comentario_txt", "{\"comentario_txt\"=>\"234242424\"}"], ["created_at", "2018-10-08 14:57:52.779345"], ["updated_at", "2018-10-08 14:57:52.779345"]]
---
  def create
     @comentario = Comentario.new(:user_id =>params[:user_id] , :item_id =>params[:item_id] , :comentario_txt => params[:comentario])

    respond_to do |format|
      if @comentario.save

SELECT  "comentarios".* FROM "comentarios" WHERE "comentarios"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_comentario
      @comentario = Comentario.find(params[:id])