app/controllers/items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."type_item" = ? ORDER BY "items"."id" ASC LIMIT ?  [["type_item", 0], ["LIMIT", 1]]
---
  def index
    @items = Item.where(:type_item =>  params[:type] )